src/Catalogs/ВнешниеЦКК/ВнешниеЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеЦКК</name>
  <attributes>
    <name>WSСсылкаInputStatisticsDate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнешнегоЦКК</name>
    <type>
      <types>EnumRef.ТипыВнешнихЦКК</types>
    </type>
  </attributes>
  <attributes>
    <name>УИДПользователя</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортСчетчиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипыВнешнихЦКК/ТипыВнешнихЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВнешнихЦКК</name>
  <enumValues>
    <name>Главные</name>
  </enumValues>
  <enumValues>
    <name>Подчиненные</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВСпискеВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Скайп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляРегистрацииОшибок</name>
    <comment>Идентификатор пользователя во внешней системе для регистрации ошибок</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RestApiМетод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RestApiАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Выбрана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СинонимРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ВнешниеЦКК/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ЭтотОбъект.УИДПользователя);
	
	Если ЭтотОбъект.ТипВнешнегоЦКК = Перечисления.ТипыВнешнихЦКК.Подчиненные Тогда
		Если ПользовательИБ = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		КонецЕсли;
		ПользовательИБ.Имя = ЭтотОбъект.Пользователь;
		ПользовательИБ.ПолноеИмя = ЭтотОбъект.Пользователь + " (создан автоматически для подчинненого ЦКК)";
		ПользовательИБ.Пароль = ЭтотОбъект.Пароль;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.InputStatistics);
		ПользовательИБ.Записать();
		
		ЭтотОбъект.УИДПользователя = ПользовательИБ.УникальныйИдентификатор;
		
		Пользователь1С_Ссылка = Справочники.Пользователи.НайтиПоНаименованию(ЭтотОбъект.Пользователь);
		Если Пользователь1С_Ссылка = Справочники.Пользователи.ПустаяСсылка() Тогда
			Пользователь1С = Справочники.Пользователи.СоздатьЭлемент();
			Пользователь1С.Наименование = ЭтотОбъект.Пользователь;
			Пользователь1С.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
			РольПользователя = Пользователь1С.Роли.Добавить();
			РольПользователя.Выбрана = Истина;
			РольПользователя.Роль = "InputStatistics";
			РольПользователя.СинонимРоли = "Input statistics";
		Иначе
			Пользователь1С = Пользователь1С_Ссылка.ПолучитьОбъект();
		КонецЕсли;
		Пользователь1С.Записать();
	Иначе
		Если ПользовательИБ <> Неопределено Тогда
			ПользовательИБ.Удалить();
			ЭтотОбъект.УИДПользователя = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
